import pymorphy2

text = """
	Таким образом, семантический разбор внешних противодействий предполагает независимые способы реализации глубокомысленных рассуждений. "
    Имеется спорная точка зрения, гласящая примерно следующее: некоторые особенности внутренней политики подвергнуты целой серии независимых исследований."
	Но некоторые особенности внутренней политики превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.
	Стремящиеся вытеснить традиционное производство, нанотехнологии освещают чрезвычайно интересные особенности картины в целом, однако конкретные выводы, разумеется, функционально разнесены на независимые элементы.
	Есть над чем задуматься: явные признаки победы институциализации лишь добавляют фракционных разногласий и смешаны с неуникальными данными до степени совершенной неузнаваемости, из-за чего возрастает их статус бесполезности.
	А еще непосредственные участники технического прогресса призывают нас к новым свершениям, которые, в свою очередь, должны быть превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.
	А также предприниматели в сети интернет, инициированные исключительно синтетически, ограничены исключительно образом мышления.
	Для современного мира синтетическое тестирование создает необходимость включения в производственный план целого ряда внеочередных мероприятий с учетом комплекса анализа существующих паттернов поведения.
	Также как перспективное планирование обеспечивает актуальность укрепления моральных ценностей.
	Банальные, но неопровержимые выводы, а также действия представителей оппозиции призывают нас к новым свершениям, которые, в свою очередь, должны быть объединены в целые кластеры себе подобных."
	"""
text_split = text.split(" ")



morph = pymorphy2.MorphAnalyzer()



for a in text_split:

	parse = morph.parse(a)[0] #метод morph.analyzer возвращает все разборы, с [0] главное

	result = parse.normalized #нормальная форма, не работает без [0] выше

	sklon = parse.inflect({"gent"})

	lex = parse.lexeme

	print("Простой разбор", parse)

	print("Нормализовано: ", result)

	print("Склонение в родительном: ", sklon)

	print("Лексемы: ", lex)

	print("#################")
